tap "homebrew/bundle"
tap "nikitabobko/tap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Cross-platform make
brew "cmake"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# Portable Foreign Function Interface library
brew "libffi"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Ncurses based sudoku game
brew "nudoku"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Command-line Kanban board/task manager with support for Trello
brew "taskell"
# Tool Command Language
brew "tcl-tk"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Terminal multiplexer
brew "tmux"
# Command-line tool to track (your) time
brew "watson"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Sound and music editor
cask "ableton-live-suite@11"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Chromium based browser
cask "arc"
# Installer and license activation for Arturia products
cask "arturia-software-center"
# Desktop password and login vault
cask "bitwarden"
# Flexible space to create your own interactive software
cask "cycling74-max"
# Voice and text chat software
cask "discord"
cask "font-mononoki-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Keyboard customiser
cask "karabiner-elements"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Administration tool for Native Instruments products
cask "native-access"
# Get up and running with large language models locally
cask "ollama"
# Control your tools with a few keystrokes
cask "raycast"
# Email client
cask "readdle-spark"
# Save articles to read, highlight key content, and organise notes for review
cask "reader"
# Collection of apps available by subscription
cask "setapp"
# Audio Effects Plugins
cask "soundtoys"
# Download manager for Spitfire audio libraries
cask "spitfire-audio"
# Video game digital distribution service
cask "steam"
# Unpacks archive files
cask "the-unarchiver"
# Multiplayer code editor
cask "zed"
# Open-source markdown editor
cask "zettlr"
mas "Xcode", id: 497799835
