tap "homebrew/bundle"
tap "nikitabobko/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Cross-platform make
brew "cmake"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Terminal multiplexer
brew "tmux"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# UNIX shell (command interpreter)
brew "zsh"
# Sound and music editor
cask "ableton-live-suite@11"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Chromium based browser
cask "arc"
# Installer and license activation for Arturia products
cask "arturia-software-center"
# Menu bar icon organiser
cask "bartender"
# Desktop password and login vault
cask "bitwarden"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# VPN client
cask "clearvpn"
# Voice and text chat software
cask "discord"
cask "font-mononoki"
# Keyboard customiser
cask "karabiner-elements"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Administration tool for Native Instruments products
cask "native-access"
# Control your tools with a few keystrokes
cask "raycast"
# Email client
cask "readdle-spark"
# Save articles to read, highlight key content, and organise notes for review
cask "reader"
# Collection of apps available by subscription
cask "setapp"
# Audio Effects Plugins
cask "soundtoys"
# Download manager for Spitfire audio libraries
cask "spitfire-audio"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Multiplayer code editor
cask "zed"
mas "Calendars", id: 608834326
