tap "homebrew/bundle"
tap "nikitabobko/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Cross-platform make
brew "cmake"
# Distributed revision control system
brew "git"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# UNIX shell (command interpreter)
brew "zsh"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Chromium based browser
cask "arc"
# Desktop password and login vault
cask "bitwarden"
cask "font-mononoki"
# Keyboard customiser
cask "karabiner-elements"
# Control your tools with a few keystrokes
cask "raycast"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
